АлогистикТест2/src/Documents/алк_ИнвентаризационнаяОписьУПСС/алк_ИнвентаризационнаяОписьУПСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ИнвентаризационнаяОписьУПСС</name>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Диаметр</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерШтабеля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаШтабеля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаШтабеля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СмешанныйДиаметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлотныйОбъемШтабеля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемШтабеля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмешанныйОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмешанныйДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Замеры</name>
    <attributes>
      <name>ВысотаШтабеля</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ИнвентаризационнаяОписьУПСС/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗамерыВысотаШтабеляПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Замеры.ТекущиеДанные; 
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;             
	
	Если  СтрокаТЧ.НомерСтроки < Объект.Замеры.Количество() Тогда 
		ИндексСледСтроки = СтрокаТЧ.НомерСтроки;    
		Элементы.Замеры.ТекущаяСтрока = Объект.Замеры[ИндексСледСтроки].ПолучитьИдентификатор(); 
	КонецЕсли; 
	
	Объект.ОбъемШтабеля = РассчитатьОбъемШтабеля(); 
    Объект.ПлотныйОбъемШтабеля =  РассчитатьПлотныйОбъемШтабеля() ;

    ОбщаяяВысотаШтабеля = РассчитатьОбщаяяВысотаШтабеля() ;  
	СредняяВысотаШтабеля = РассчитатьСредняяВысотаШтабеля() ;    
	КоличествоЗамеров = РассчитатьКоличествоЗамеров() ;  
	
КонецПроцедуры

&НаКлиенте
Процедура СмешанныйПриИзменении() 
	
	Если Смешанный = Ложь Тогда  
		Элементы.Диаметр.Видимость = Истина;  
		Элементы.Диаметр.Доступность =  Истина; 
		Элементы.СмешанныйДиаметр.Видимость = Ложь;   
		Элементы.СмешанныйДо.Видимость = Ложь;
		Элементы.СмешанныйОт.Видимость = Ложь;   
		Элементы.СмешанныйДиаметр.Доступность = Ложь;   
		Элементы.СмешанныйДо.Доступность = Ложь;
		Элементы.СмешанныйОт.Доступность = Ложь;
		Объект.СмешанныйДо = 0;   
		Объект.СмешанныйОт = 0; 
		//Объект.СмешанныйДиаметр = "";


	Иначе
		Элементы.Диаметр.Видимость = Ложь; 
		Элементы.Диаметр.Доступность = Ложь;
		Объект.Диаметр = ПолучитьПустуюСсылкуДиаметр();
		Элементы.СмешанныйДиаметр.Видимость = Истина;
		Элементы.СмешанныйДо.Видимость = Истина;
		Элементы.СмешанныйОт.Видимость = Истина;
        Элементы.СмешанныйДиаметр.Доступность = Истина;  
		Элементы.СмешанныйДо.Доступность = Истина;
		Элементы.СмешанныйОт.Доступность = Истина;

   	КонецЕсли;

КонецПроцедуры    

  &НаСервере
Функция ПолучитьПустуюСсылкуДиаметр() 
	
	Возврат Справочники.РазмерСечения.ПустаяСсылка();
	
КонецФункции   

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	Если ЗначениеЗаполнено(Объект.СмешанныйДиаметр) ИЛИ ЗначениеЗаполнено(Объект.СмешанныйОт)ИЛИ ЗначениеЗаполнено(Объект.СмешанныйДо) Тогда
		Смешанный = Истина;
		СмешанныйПриИзменении(); 
		
	КонецЕсли;

	Объект.ОбъемШтабеля = РассчитатьОбъемШтабеля(); 
    Объект.ПлотныйОбъемШтабеля =  РассчитатьПлотныйОбъемШтабеля() ;

	ОбщаяяВысотаШтабеля = РассчитатьОбщаяяВысотаШтабеля() ;
    СредняяВысотаШтабеля = РассчитатьСредняяВысотаШтабеля() ;
	КоличествоЗамеров = РассчитатьКоличествоЗамеров() ;

	ПолучитьВладельцаШтабеля();    
	
	
КонецПроцедуры     

&НаСервере
Процедура ПолучитьВладельцаШтабеля() 
	
	ВладелецШтабеля = Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Участок сортированных лесоматериалов ЦЛП");
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ВладелецШтабеля);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Штабель.ПараметрыВыбора = НовыеПараметры; 
	
КонецПроцедуры                                         

&НаСервере
Функция РассчитатьОбщаяяВысотаШтабеля()  

	Возврат  Объект.Замеры.Итог("ВысотаШтабеля");	
  
КонецФункции      

&НаСервере
Функция РассчитатьСредняяВысотаШтабеля()  
	
    Количество = РассчитатьКоличествоЗамеров() ;  
	Если Количество <> 0  Тогда
	Возврат  Объект.Замеры.Итог("ВысотаШтабеля")/Количество;	
КонецЕсли;

КонецФункции 

 &НаСервере
Функция РассчитатьКоличествоЗамеров()  
	
	Штабели = Объект.Замеры.Выгрузить(,"ВысотаШтабеля");  
	Количество = 0;   
	Для каждого Стр из Штабели Цикл
		Если Стр.ВысотаШтабеля <> 0  Тогда
			Количество = Количество +1 ; 
		КонецЕсли;
	КонецЦикла;	 
	Возврат  Количество;	
  
КонецФункции 

&НаСервере
Функция РассчитатьОбъемШтабеля()  
	 
	Количество = РассчитатьКоличествоЗамеров() ;   
	 
	
	Если Количество <> 0  Тогда
		СрВысота = Объект.Замеры.Итог("ВысотаШтабеля")/Количество;  
	Иначе СрВысота = 0;
	КонецЕсли; 
	
	ОбъемШтабеля = Объект.ДлинаШтабеля * Объект.ШиринаШтабеля * СрВысота;
	Возврат  ОбъемШтабеля;	
  
КонецФункции 

&НаСервере
Функция РассчитатьПлотныйОбъемШтабеля() 
	
  ПлотныйОбъемШтабеля = ОбъемШтабеля * Объект.Коэффициент;
  Возврат  ПлотныйОбъемШтабеля;	
  
КонецФункции  

&НаКлиенте
Процедура ЗамерыПриИзменении(Элемент)    
	
	//Переделать все на док
	Объект.ОбъемШтабеля = РассчитатьОбъемШтабеля(); 
    Объект.ПлотныйОбъемШтабеля =  РассчитатьПлотныйОбъемШтабеля() ;
	
    ОбщаяяВысотаШтабеля = РассчитатьОбщаяяВысотаШтабеля() ;
    КоличествоЗамеров = РассчитатьКоличествоЗамеров() ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбъем(Команда)     
	
	Объект.ОбъемШтабеля = РассчитатьОбъемШтабеля(); 
    Объект.ПлотныйОбъемШтабеля =  РассчитатьПлотныйОбъемШтабеля() ;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаШтабеляПриИзменении(Элемент)
	
	Объект.ОбъемШтабеля = РассчитатьОбъемШтабеля(); 
    Объект.ПлотныйОбъемШтабеля =  РассчитатьПлотныйОбъемШтабеля() ;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлинаШтабеляПриИзменении(Элемент)  
		
	Объект.ОбъемШтабеля = РассчитатьОбъемШтабеля(); 
    Объект.ПлотныйОбъемШтабеля =  РассчитатьПлотныйОбъемШтабеля() ;

КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)   
		
	Объект.ОбъемШтабеля = РассчитатьОбъемШтабеля(); 
    Объект.ПлотныйОбъемШтабеля =  РассчитатьПлотныйОбъемШтабеля() ;
	
КонецПроцедуры
